Tekla.Structures.Drawing.Surfacing
The Surfacing class contains methods related to surfacings.
A surfacing is a drawing object derived from a model object.
It represents a drawing surfacing that has a reference to the
actual surfacing in the model database.

Tekla.Structures.Drawing.Surfacing.Attributes
The attributes of the surfacing.
For more information see Tekla.Structures.Drawing.Surfacing.SurfacingAttributes.

Tekla.Structures.Drawing.Surfacing.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.Surfacing.#ctor(System.Boolean)
Create instance of Surfacing

Tekla.Structures.Drawing.Surfacing.#ctor
Create instance of Surfacing

Tekla.Structures.Drawing.Surfacing.Delete
Calls the system to delete the object.
Returns: True on success.

Tekla.Structures.Drawing.Surfacing.Modify
Calls the system to update/modify the object.
Returns: True on success.

Tekla.Structures.Drawing.Surfacing.Insert
NOT YET IMPLEMENTED.
Returns: False.

Tekla.Structures.Drawing.Surfacing.Select
Selects the drawing surfacing from the current drawing database.
Returns: True on success.